{"html_attributions":[],"result":{"formatted_address":"102 Huntingdale Rd, Mount Waverley VIC 3149, Australia","formatted_phone_number":"(03) 9888 8447","geometry":{"location":{"lat":-37.859583,"lng":145.113643}},"name":"Essex Heights Juniors Early Learning & Child Care Centre","opening_hours":{"open_now":false,"periods":[{"close":{"day":1,"time":"1800"},"open":{"day":1,"time":"0700"}},{"close":{"day":2,"time":"1800"},"open":{"day":2,"time":"0700"}},{"close":{"day":3,"time":"1800"},"open":{"day":3,"time":"0700"}},{"close":{"day":4,"time":"1800"},"open":{"day":4,"time":"0700"}},{"close":{"day":5,"time":"1800"},"open":{"day":5,"time":"0700"}}],"weekday_text":["Monday: 7:00 AM – 6:00 PM","Tuesday: 7:00 AM – 6:00 PM","Wednesday: 7:00 AM – 6:00 PM","Thursday: 7:00 AM – 6:00 PM","Friday: 7:00 AM – 6:00 PM","Saturday: Closed","Sunday: Closed"]},"photos":[{"height":497,"html_attributions":["<a href=\"https://maps.google.com/maps/contrib/110129570812370591279\">Paul Deng</a>"],"photo_reference":"Aap_uEDF1ohhDqke0mcEYp0WlNzMEXPTHHObjA5Pza8qBh9DxurBNM3HAcMbw-6aUKTjWf4g_x8xfTcGlDVMAtzSd7Y1DLxW6f-glMGAu9S8DS6Ca8FIb24-5fjbhIUHFHoAb31qhYGbDLOq7cpY1BuKjj9JdUD_vAylxeK2QWqYTFFcLYWY","width":800}],"rating":4.7,"reviews":[{"author_name":"Sally Jessop","author_url":"https://www.google.com/maps/contrib/116285877855938659700/reviews","language":"en","profile_photo_url":"https://lh3.googleusercontent.com/a/AATXAJwr-xekxPy65vTKTwqnbWd-Y0Tl7pvfdicUUs7v=s128-c0x00000000-cc-rp-mo","rating":5,"relative_time_description":"3 months ago","text":"EHJ is amazing!! Paula and her team went above and beyond to provide an educational, professional and fun setting for our 2 kids. We feel incredibly lucky to have been a part of the EHJ family for the last 4 years and cannot recommend it highly enough.","time":1646887747},{"author_name":"Sylwia","author_url":"https://www.google.com/maps/contrib/112870202697357918225/reviews","language":"en","profile_photo_url":"https://lh3.googleusercontent.com/a/AATXAJzzIT53GrJkhSE3UYALUUD4TNWhjWpGf_Atz4Ql=s128-c0x00000000-cc-rp-mo","rating":5,"relative_time_description":"3 months ago","text":"I have had my two kids at EHJ for over 6 years. Paula and the team have become an extended family to us and have been there to support us from the beginning in which was an emotional and transitional time for the kids.\n\nAll of the staff have always acted with patience and provided the kids with quality care every day they attended. They welcomed them with open arms, wiped away tears, stayed with them when they were feeling down and reassured them with warm smiles. It was always comforting for us knowing that our kids were safe, learning and most of all having fun.\n\nWhilst they have multiple parents and children to deal with, they have always taken the time to deal with us with such care and ensuring all the children's needs were met.\n\nEHJ has instilled a passion for learning, embraced individuality and most of all taught and helped build character.\n\nOur kids have grown tremendously  in the past 6 years with the care of the team and they have helped and been there throughout the milestones.\n\nThe words and actions of the team at EHJ will never never be forgotten, and the memories will last a lifetime.\n\nThank you,\n\nThe Petrolo family","time":1646190926},{"author_name":"AJ","author_url":"https://www.google.com/maps/contrib/102994636697460484359/reviews","language":"en","profile_photo_url":"https://lh3.googleusercontent.com/a/AATXAJzbo5mGba_7Y2CDRu0SOrfIdfV6QkbHAXetiEoH=s128-c0x00000000-cc-rp-mo","rating":5,"relative_time_description":"4 months ago","text":"The best childcare in the area.  Our kids attended EHJ and loved it. They learnt a lot too in preparation for school.  Great educators, we felt comfortable leaving our kids with them.  Very well organised and smoothly run - big thanks, guys!","time":1642386089},{"author_name":"Carolyn G","author_url":"https://www.google.com/maps/contrib/114029266277044144068/reviews","language":"en","profile_photo_url":"https://lh3.googleusercontent.com/a/AATXAJxvYm_OfuAc730O1k791-IRvzc907eiIcoM7vOY=s128-c0x00000000-cc-rp-mo","rating":5,"relative_time_description":"a year ago","text":"We had five wonderful years of our children attending Essex Heights Juniors and we feel so lucky that they had the opportunity to attend. Paula and Arthur run a very tight ship so we have always felt comfortable leaving our children in their care and have never had any issues. Jane and all the educators are all so caring, friendly and amazing with the children and the activities, excursions and learning opportunities available are the best part of program. Another highlight is the end of year functions for all the year levels. My children both loved attending and their time at Juniors has helped them develop into very confident and happy young people. Thanks to all the staff at Juniors. We love you all!","time":1610666091},{"author_name":"Yvonne Xu","author_url":"https://www.google.com/maps/contrib/100604036928813035916/reviews","language":"en","profile_photo_url":"https://lh3.googleusercontent.com/a/AATXAJwrt7T_BTV0k7fsMRLl9RslSBzHpFqg3ovhBind=s128-c0x00000000-cc-rp-mo","rating":1,"relative_time_description":"10 months ago","text":"This is not only the experience of my family and kid but another family’s as I know who’s kid attend Essex heights junior. I dare not post this review until my kids went to another cc and turns out she’s very happy and content over there plus one of my friends who’s son attend Essex height recently withdraw and change to another cc which had the same bad experience in there. We had only 20mins orientation and staff only ask few questions about the kids and said times up that’s it. My daughter is unsettled over there and they asked for picking up every time after only 20-30mins(when I was on the way home!) for the first 3 weeks they doing this every time! I could not do anything during those days just waiting for their calls! They push everything and problem to parents if there’s any “problem” of the kids they says that parents problem. I did not see any staff in the room have their own kid. They are all graduates have no experience of raising kids. How do you expect they can understand the need of kids and feel the same of the parents?! We have withdrawn after 3 weeks attending they had charged us 2 weeks more fees and they won’t refund the bond! How ridiculous? At last, if you are looking for childcare for you child here are some advice: avoid this one unless you feel secure and you want to take a risk. Have enough orientation and have a thorough understanding of the centers approaches to settle child. Talk about your child’s personality and interest to the staff see if they really listen to you and care about each kids!","time":1626912221}],"url":"https://maps.google.com/?cid=6504182145025431958","website":"http://www.essexheightsjuniors.com.au/"},"status":"OK"}