{"html_attributions":[],"result":{"formatted_address":"624-628 Bridge Rd, Richmond VIC 3121, Australia","formatted_phone_number":"(03) 9429 2944","geometry":{"location":{"lat":-37.8200983,"lng":145.0118416}},"name":"Bridge Road Early Learning Centre","opening_hours":{"open_now":false,"periods":[{"close":{"day":1,"time":"1830"},"open":{"day":1,"time":"0800"}},{"close":{"day":2,"time":"1830"},"open":{"day":2,"time":"0800"}},{"close":{"day":3,"time":"1830"},"open":{"day":3,"time":"0800"}},{"close":{"day":4,"time":"1830"},"open":{"day":4,"time":"0800"}},{"close":{"day":5,"time":"1830"},"open":{"day":5,"time":"0800"}}],"weekday_text":["Monday: 8:00 AM – 6:30 PM","Tuesday: 8:00 AM – 6:30 PM","Wednesday: 8:00 AM – 6:30 PM","Thursday: 8:00 AM – 6:30 PM","Friday: 8:00 AM – 6:30 PM","Saturday: Closed","Sunday: Closed"]},"rating":4.5,"reviews":[{"author_name":"Ngaiaful","author_url":"https://www.google.com/maps/contrib/102942332773170761074/reviews","language":"en","profile_photo_url":"https://lh3.googleusercontent.com/a/AATXAJz8UFfl8FE6SsRaroraMSj98FzgnC-8GR6ILKnL=s128-c0x00000000-cc-rp-mo","rating":5,"relative_time_description":"5 months ago","text":"We could not have chosen a better daycare for our family. We loved the environment (particularly the outdoor space with real dirt and nature and animals!) and the feel of this centre. Great food. Fantastic responsiveness/daily updates of menu and ongoing. The staff are fabulous, creative, caring and curious. Our son thrived and was supported and created bonds with all staff across all rooms. It certainly has a family vibe to it. Whilst we had to say goodbye to many carers in 3 years, we were never let down by the new starters and this was navigated somewhat seamlessly. We met so many special people and we miss BRELC. It will forever hold a special place in our hearts!","time":1639696996},{"author_name":"Charlotte Chaleyer","author_url":"https://www.google.com/maps/contrib/109219973161825191575/reviews","language":"en","profile_photo_url":"https://lh3.googleusercontent.com/a/AATXAJy1-uDnwceKJWMWRIrbDzq6-tAobTS02ZjG4RR_aQ=s128-c0x00000000-cc-rp-mo","rating":5,"relative_time_description":"6 months ago","text":"My son attended BRELC for 3.5 years and I could not be happier with the care and education he received throughout his time there. All the educators bring their own style, passion and personality to the role which creates diversity and allows the little ones to build trust and unique relationships with each educator. Throughout the pandemic BRELC maintained an extremely high level of professional care and standards,  providing continuity and routine for my son as he continued his growth journey during a very uncertain and difficult time.  Over the years my son and I have built strong relationships with the staff and they always provided support, flexibility and a genuine interest in our well-being. As a first time mother I experienced the usual anxieties of entrusting others with the care of my son however this was not the case with BRELC- the centre's vibe and operation is much like a large extended family and I knew my son was in the best care. He is now ready for a seamless transition into primary school and I have the centre to thank for all of their hard work, tailored care and education provided. I highly recommend BRELC.","time":1638761726},{"author_name":"Justine Glucina","author_url":"https://www.google.com/maps/contrib/105756456089797805038/reviews","language":"en","profile_photo_url":"https://lh3.googleusercontent.com/a-/AOh14Gi2O72egTKH1qVCNbNfv9dll07I1kRICrrRSgIg2A=s128-c0x00000000-cc-rp-mo","rating":5,"relative_time_description":"a year ago","text":"I don't really know where to start with this review because we have absolutely loved sending our daughter to Bridge Road ELC. Initially she was at a much bigger, louder, sterile daycare with loads of kids and no easy access to outdoors. The staff there didn't get to know our daughter and she hated it. So when I found Bridge Road and saw how much she enjoyed it, felt safe and comfortable, I knew it was right. It has a warm family feel, the teachers all took the time to really get to understand our daughter, they welcomed us from day one and we couldn't have asked for better care. If we weren't relocating to NZ we would be sending our boy there too. Can't recommend enough!","time":1602060632},{"author_name":"J Wang","author_url":"https://www.google.com/maps/contrib/107730298890468040582/reviews","language":"en","profile_photo_url":"https://lh3.googleusercontent.com/a/AATXAJxyqso3owkm84icvvcJ5I_AFziUoI4gqLOPA585=s128-c0x00000000-cc-rp-mo","rating":5,"relative_time_description":"3 years ago","text":"We stumbled upon this gem over 5 years ago and have sent all three of our children to BRELC. The educators and management staff are capable, responsive and kind. They work incredibly hard to provide the children with a nurturing environment\nand lots of enriching learning experiences and opportunities, and have always been so accommodating and supportive to us as parents. Would not hesitate to recommend.","time":1552528530},{"author_name":"Laura L","author_url":"https://www.google.com/maps/contrib/110626902163117188067/reviews","language":"en","profile_photo_url":"https://lh3.googleusercontent.com/a/AATXAJxjb5bC9LnTxxTPQXGNLS8Erx_Tq-1UNlqnLHka=s128-c0x00000000-cc-rp-mo","rating":5,"relative_time_description":"3 years ago","text":"We have had a wonderful experience at BRELC, our son has thrived in such a nurturing,caring, friendly environment. He continues to surprise us with the new things he learns with the support of his wonderful educators.","time":1542342774}],"url":"https://maps.google.com/?cid=3037671856634051950","website":"http://www.bridgeroadelc.com.au/"},"status":"OK"}